Repository: pkp/controlPublicFiles
Catalog: locale/*/locale.po
Languages: ar, nb, pt_br

# plugins.generic.controlPublicFiles.displayName
source: Control Public Files
ar: التحكم بالملفات العامة
nb: Kontroller offentlige filer
pt_br: Controlar Arquivos Públicos

# plugins.generic.controlPublicFiles.description
source: Limit who can upload public files and what kind of files they can upload.
ar: تحديد من بإمكانه رفع الملفات العامة وتحديد أنواعها.
nb: Begrens hvem som kan laste opp offentlig tilgjengelige filer, og hvilke filtyper de kan laste opp.
pt_br: Limitar quem pode fazer upload de arquivos públicos e que tipo de arquivos que eles podem fazer upload.

# plugins.generic.controlPublicFiles.setting.allowedDirSize
source: Allowed Directory Size
ar: حجم المجلد المسموح به
nb: Tillatt mappestørrelse
pt_br: Tamanho do diretório permitido

# plugins.generic.controlPublicFiles.setting.allowedDirSize.description
source: Set a limit to the total file size of each user's public upload directory in bytes. Default is 25000 (25mb).
ar: وضع حد لأقصى حجم إجمالي من ملفات المستخدم لكل مجلد عمومي للمستخدمين مقاسًا بالبايت. الافتراضي هو 25000 (25mb).
nb: Sett en grense for den totale filstørelsen hver brukers offentlig tilgjengelige opplastingsmappe kan være i bytes. Standard er 25000 (25Mb).
pt_br: Defina um limite para o tamanho total do arquivo do diretório de upload público de cada usuário em bytes. O padrão é 25000 (25mb).

# plugins.generic.controlPublicFiles.setting.allowedFileTypes
source: Allowed File Types
ar: أنواع الملفات المسموح بها
nb: Tillatte filtyper
pt_br: Tipos de arquivos permitidos

# plugins.generic.controlPublicFiles.setting.allowedFileTypes.description
source: Limit what kind of files can be uploaded. Separate each file with a comma. The default is "gif,jpg,png".
ar: تقييد أنواع الملفات التي بالإمكان رفعها. إفصل ما بين الأنواع بفارزة إنجليزية. الافتراضي هو "gif,jpg,png".
nb: Begrens hvilke filtyper som kan lastes opp. Separer hver filtype med komma. Standard er "gif,jpg,png".
pt_br: Limite o tipo de arquivo que pode ser carregado. Separe cada arquivo com uma vírgula. O padrão é "gif, jpg, png".

# plugins.generic.controlPublicFiles.setting.disableAllUploads
source: Disable All Uploads
ar: تعطيل كل عمليات الرفع
nb: Deaktiver alle opplastinger
pt_br: Desativar todos os uploads

# plugins.generic.controlPublicFiles.setting.disableRoles
source: Disable By Role
ar: التعطيل حسب الدور
nb: Deaktiver etter rolle
pt_br: Desativar por papel

# plugins.generic.controlPublicFiles.setting.disableAllUploads.description
source: Don't allow any users to upload files through the text editor.
ar: لا تسمح لأي مستخدم برفع الملفات باستعمال محرر النصوص.
nb: Ikke tillat noen brukere å laste opp filer gjennom tekstverktøyet.
pt_br: Não permita que nenhum usuário faça upload de arquivos através do editor de texto.

# plugins.generic.controlPublicFiles.setting.disableRoles.option
source: Don't allow {$role} to upload files through the text editor.
ar: لا تسمح لمن يمتلك دور {$role} برفع الملفات باستعمال محرر النصوص.
nb: La ikke {$role} laste opp filer via tekstverktøyet.
pt_br: Não permita que {$role} faça upload de por meio do editor de texto.

# plugins.generic.controlPublicFiles.settings.description
source: <p>Users can upload images wherever they are presented with a rich text editor that includes the image upload control. This includes places like the About the Journal section as well as the user biography in every user's profile area.</p><p>The settings below allow you to restrict who can upload, what kind of files they can upload, and how large their directory of files can grow.</p>
ar: <p>يمكن للمستخدمين رفع الصور كلما عرض لهم محرر نصوص يشتمل على خاصية رفع الصور. هذا يشمل مواضع متعددة مثل مقطع عن المجلة فضلاً عن السيرة الذاتية للمستخدم في كل مناطق ملفاتهم الشخصية.</p><p>الإعدادات أدناه تسمح لك بتقييد من بإمكانه الرفع، ما أنواع الملفات التي يمكنه رفعها، وإلى أي حد يمكن أن يتوسع مجلد ملفاته.</p>
nb: <p>Brukerne kan laste opp bilder, uansett der de presenteres med et tekstverktøy som inkluderer opplasting av bilder. Dette gjelder steder som avsnittet "Om tidsskriftet" samt brukerbiografien i alle brukeres profilområde.</p><p>Innstillingene nedenfor lar deg begrense hvem som kan laste opp, hva slags filer de kan laste opp, og hvor mye lagringsplass opplastingsmappen til hver bruker får lov til å bruke.</p>
pt_br: <p> Os usuários podem fazer upload de imagens onde quer que sejam apresentadas com um editor de texto rico, que inclui o controle de upload de imagens. Isso inclui locais como a seção Sobre da Revista, bem como a biografia do usuário na área de perfil de todos os usuários.</p><p> As configurações abaixo permitem restringir quem pode carregar, que tipo de arquivos eles podem carregar e qual o tamanho o diretório de arquivos podem aumentar. </p>

# plugins.generic.controlPublicFiles.setting.applyToLibraryFileUploads
source: Apply To Library File Upload
ar: التطبيق لرفع ملف المكتية

# plugins.generic.controlPublicFiles.error
source: Only the following file extensions are allowed: {$allowedExtensions}.
ar: فقط امتدادات الملفات الآتية مسموح بها: {$allowedExtensions}.

# plugins.generic.controlPublicFiles.setting.applyToLibraryFileUploads.description
source: Apply file type rules to submission library file upload
ar: تطبيق قواعد أنواع الملفات مع رفع ملف مكتبة طلب التقديم
